{
  "articles": [
    {
      "id": "1",
      "title": "Angular 16: Les nouveautés",
      "content": "Les nouveautés d'Angular 16 incluent...",
      "fullContent": "Angular 16 apporte des améliorations notables telles que de nouveaux outils pour faciliter le développement d'applications web. Les fonctionnalités incluent des mises à jour du système de modules, des améliorations de la performance, ainsi qu'un meilleur support pour les applications mobiles. Angular 16 se distingue également par son approche simplifiée du code et la réduction des coûts d'exécution.",
      "createdAt": "2023-05-01",
      "image": "https://cdn.pixabay.com/photo/2025/11/06/04/45/water-9939989_1280.jpg",
      "likeCount": 233,
      "isPublished": true,
      "categoryName": "Angular",
      "isLiked": false
    },
    {
      "id": "2",
      "title": "Développer une API REST",
      "content": "Développer une API REST nécessite de bonnes pratiques...",
      "fullContent": "Le développement d'une API RESTful repose sur des principes solides d'architecture logicielle, permettant de créer des services flexibles et scalables. L'utilisation de méthodes HTTP standardisées (GET, POST, PUT, DELETE) facilite l'interaction entre le client et le serveur. Une API bien conçue doit être simple, sécurisée et documentée de manière claire pour faciliter son adoption par les développeurs.",
      "createdAt": "2023-04-15",
      "image": "https://cdn.pixabay.com/photo/2025/11/04/16/58/shipwreck-9936816_1280.jpg",
      "likeCount": 99,
      "isPublished": true,
      "categoryName": "API",
      "isLiked": false
    },
    {
      "id": "3",
      "title": "Pourquoi TypeScript est essentiel ?",
      "content": "TypeScript apporte de la robustesse au code JavaScript...",
      "fullContent": "TypeScript est un sur-ensemble statiquement typé de JavaScript qui permet d'ajouter des types à votre code. Il aide à éviter les erreurs courantes liées aux types de données, améliore l'autocomplétion et facilite la maintenance du code. Ce langage est largement adopté dans les grandes bases de code et permet de développer des applications plus robustes et évolutives.",
      "createdAt": "2023-03-12",
      "image": "https://cdn.pixabay.com/photo/2025/10/16/08/18/shark-9897726_1280.jpg",
      "likeCount": 95,
      "isPublished": true,
      "categoryName": "JavaScript",
      "isLiked": false
    },
    {
      "id": "4",
      "title": "Les bases de Spring Boot",
      "content": "Spring Boot simplifie le développement Java...",
      "fullContent": "Spring Boot est un framework Java qui simplifie la création d'applications de qualité. Il offre des configurations par défaut, une sécurité intégrée et une architecture modulaire. Il permet de développer des applications web robustes avec peu de configurations. De plus, Spring Boot est conçu pour être utilisé avec des outils modernes de gestion des versions et des tests, ce qui accélère le processus de développement.",
      "createdAt": "2023-02-20",
      "image": "https://cdn.pixabay.com/photo/2025/10/02/06/28/mood-9867715_1280.jpg",
      "likeCount": 80,
      "isPublished": true,
      "categoryName": "Spring",
      "isLiked": false
    },
    {
      "id": "5",
      "title": "Introduction à RxJS",
      "content": "RxJS facilite la gestion des données asynchrones...",
      "fullContent": "RxJS est une bibliothèque JavaScript pour la programmation réactive qui simplifie la gestion des données asynchrones. Grâce aux Observables, il est possible de gérer facilement les flux de données, qu'il s'agisse de réponses HTTP, d'événements utilisateur ou de tout autre type de données asynchrones. RxJS est un atout précieux pour les applications modernes nécessitant une gestion avancée des événements et de la synchronisation.",
      "createdAt": "2023-01-15",
      "image": "https://cdn.pixabay.com/photo/2024/01/19/13/27/castle-8519077_1280.jpg",
      "likeCount": 65,
      "isPublished": false,
      "categoryName": "JavaScript",
      "isLiked": false
    },
    {
      "id": "6",
      "title": "Node.js pour les débutants",
      "content": "Node.js permet d'utiliser JavaScript côté serveur...",
      "fullContent": "Node.js permet d'exécuter JavaScript côté serveur, offrant ainsi une plateforme idéale pour le développement d'applications web évolutives et performantes. Grâce à son moteur V8 rapide et son modèle asynchrone non-bloquant, Node.js est particulièrement adapté pour les applications en temps réel, comme les chats en ligne ou les jeux multi-joueurs.",
      "createdAt": "2023-01-01",
      "image": "https://cdn.pixabay.com/photo/2025/10/03/13/44/boathouse-9871057_1280.jpg",
      "likeCount": 150,
      "isPublished": true,
      "categoryName": "JavaScript",
      "isLiked": false
    },
    {
      "id": "7",
      "title": "Guide de démarrage avec MongoDB",
      "content": "MongoDB est une base de données NoSQL...",
      "fullContent": "MongoDB est une base de données NoSQL qui permet de stocker des données sous forme de documents au format JSON. Elle est idéale pour les applications nécessitant une grande flexibilité, comme les applications web modernes. MongoDB permet d'effectuer des requêtes complexes tout en garantissant une haute disponibilité et une évolutivité horizontale.",
      "createdAt": "2023-03-05",
      "image": "https://cdn.pixabay.com/photo/2025/10/12/16/36/sunset-glow-9890310_1280.jpg",
      "likeCount": 45,
      "isPublished": false,
      "categoryName": "Base de données",
      "isLiked": false
    },
    {
      "id": "8",
      "title": "Les nouveautés d'Angular 15",
      "content": "Découvrez ce qui a changé dans Angular 15...",
      "fullContent": "Angular 15 a introduit plusieurs nouvelles fonctionnalités et optimisations. Parmi celles-ci, on trouve l'amélioration du système de détection des changements, une meilleure prise en charge des applications mobiles, ainsi qu'une refactorisation de l'API pour la rendre plus simple et plus intuitive. Ces changements visent à rendre le framework plus rapide et plus facile à utiliser.",
      "createdAt": "2022-12-01",
      "image": "https://cdn.pixabay.com/photo/2025/06/25/12/23/ladybug-9679907_1280.jpg",
      "likeCount": 220,
      "isPublished": true,
      "categoryName": "Angular",
      "isLiked": false
    },
    {
      "id": "9",
      "title": "Comprendre le routing en React",
      "content": "Le routing permet de naviguer entre différentes pages...",
      "fullContent": "Le routing en React permet de créer des applications à page unique (SPA) en naviguant entre différentes vues sans recharger la page. React Router est la bibliothèque la plus populaire pour implémenter le routing dans une application React. Il permet de définir des routes dynamiques et des comportements de navigation complexes avec facilité.",
      "createdAt": "2022-11-11",
      "image": "https://cdn.pixabay.com/photo/2025/08/09/17/47/modelling-9764984_1280.jpg",
      "likeCount": 90,
      "isPublished": true,
      "categoryName": "React",
      "isLiked": false
    },
    {
      "id": "10",
      "title": "GraphQL vs REST: Lequel choisir ?",
      "content": "GraphQL et REST sont deux approches pour les APIs...",
      "fullContent": "GraphQL est une alternative à REST pour la création d'APIs. Contrairement à REST, GraphQL permet de récupérer exactement les données dont on a besoin, ce qui peut améliorer les performances. Cependant, il peut être plus complexe à mettre en œuvre et nécessite une gestion des schémas. REST reste une approche simple et largement utilisée pour les APIs.",
      "createdAt": "2022-10-15",
      "image": "https://cdn.pixabay.com/photo/2025/06/27/07/30/clownfish-9683275_1280.jpg",
      "likeCount": 75,
      "isPublished": false,
      "categoryName": "API",
      "isLiked": false
    },
    {
      "id": "11",
      "title": "Créer une Single Page Application avec React",
      "content": "Angular facilite la création de SPAs modernes...",
      "fullContent": "Les applications à page unique (SPA) sont de plus en plus populaires grâce à React. En utilisant React, on peut créer une application web où le contenu se charge dynamiquement, sans avoir besoin de recharger la page entière. Cela permet une expérience utilisateur plus fluide et réactive.",
      "createdAt": "2022-09-20",
      "image": "https://cdn.pixabay.com/photo/2025/10/01/11/57/walnuts-9866415_1280.jpg",
      "likeCount": 92,
      "isPublished": true,
      "categoryName": "React",
      "isLiked": false
    },
    {
      "id": "12",
      "title": "Utiliser les services dans Angular",
      "content": "Les services permettent de partager des données...",
      "fullContent": "Dans Angular, les services sont utilisés pour partager des données ou des logiques d'application entre les différents composants. Ils permettent de centraliser la gestion des données et de rendre l'application plus modulaire. L'injection de dépendances est utilisée pour fournir ces services aux composants qui en ont besoin.",
      "createdAt": "2022-08-12",
      "image": "https://cdn.pixabay.com/photo/2022/10/07/10/51/the-glacier-7504780_1280.jpg",
      "likeCount": 50,
      "isPublished": true,
      "categoryName": "Angular",
      "isLiked": false
    },
    {
      "id": "13",
      "title": "Les avantages des Web Components",
      "content": "Les Web Components permettent de créer des éléments...",
      "fullContent": "Les Web Components sont un ensemble de standards qui permettent de créer des composants réutilisables et encapsulés pour le web. Ces composants peuvent être utilisés dans n'importe quelle application web et sont totalement indépendants des autres bibliothèques ou frameworks.",
      "createdAt": "2022-07-10",
      "image": "https://cdn.pixabay.com/photo/2025/09/19/09/54/flower-9842886_1280.jpg",
      "likeCount": 85,
      "isPublished": false,
      "categoryName": "Web",
      "isLiked": false
    },
    {
      "id": "14",
      "title": "Améliorer les performances de son API",
      "content": "Optimiser une API est essentiel pour une bonne UX...",
      "fullContent": "L'optimisation des performances d'une API peut considérablement améliorer l'expérience utilisateur. Cela inclut la gestion efficace des bases de données, la mise en cache des réponses, et l'optimisation des requêtes. Les API performantes sont essentielles pour garantir des temps de réponse rapides et une meilleure utilisation des ressources.",
      "createdAt": "2022-06-20",
      "image": "https://cdn.pixabay.com/photo/2025/09/30/21/24/waterfall-9865189_1280.jpg",
      "likeCount": 130,
      "isPublished": true,
      "categoryName": "API",
      "isLiked": false
    },
    {
      "id": "15",
      "title": "Les hooks dans React",
      "content": "Les hooks offrent une nouvelle façon de gérer l'état...",
      "fullContent": "Les hooks dans React offrent une manière moderne et fonctionnelle de gérer l'état et les effets secondaires dans les composants. Les hooks comme useState et useEffect simplifient la gestion du cycle de vie d'un composant et permettent d'éviter l'utilisation de classes, rendant le code plus propre et plus facile à comprendre.",
      "createdAt": "2022-05-05",
      "image": "https://cdn.pixabay.com/photo/2024/01/11/16/42/leaves-8502147_1280.jpg",
      "likeCount": 78,
      "isPublished": true,
      "categoryName": "React",
      "isLiked": false
    },
    {
      "id": "16",
      "title": "Introduction aux Progressive Web Apps (PWA)",
      "content": "Les PWAs combinent les avantages des apps et des sites...",
      "fullContent": "Les Progressive Web Apps (PWA) sont des applications qui offrent une expérience utilisateur semblable à celle d'une application native, mais fonctionnent directement dans le navigateur. Elles sont rapides, fiables, et permettent de travailler hors ligne grâce à des services workers, offrant ainsi une expérience fluide sur tous les appareils.",
      "createdAt": "2022-04-01",
      "image": "https://cdn.pixabay.com/photo/2022/02/25/10/51/dog-7033959_1280.jpg",
      "likeCount": 60,
      "isPublished": true,
      "categoryName": "Web",
      "isLiked": false
    }
  ]
}
